In [1]:
import pandas as pd

In [3]:
data=pd.read_csv('employee.csv',index_col=0)
# here index_col=0 is used to remove the index_col which is created by default add before the column id and make the column id as index column
data.head()

        name  age  gender  salary
id
1   Shreeram   27    Male   10000
2      Shree   28  Female   12000
3        Ram   29    Male   12000
4       Riya   45    Male   13000
5     Sushma   15  Female   11000

In [5]:

data.loc[1]

print( data.loc[data['age'].idxmax()])

name       Riya
age          45
gender     Male
salary    13000
Name: 4, dtype: object

In [43]:
df = pd.read_csv('employee1.csv',header=None,names=['id','name','age','gender','salary'],index_col=0)
# here header=None means that the first row is not a header so names=[] are used to name the columns
print(df)

        name  age  gender  salary
id
1   Shreeram   27    Male   10000
2      Shree   28  Female   12000
3        Ram   29    Male   12000
4       Riya   45    Male   13000
5     Sushma   15  Female   11000
6       John   22    Male   12000

In [6]:
df = pd.read_csv('employee2.csv',skiprows=1,index_col=0)
print(df)
df=pd.read_csv('employee2.csv',header=1,index_col=0)
# here header=1 means that the first row is the header
print(df)

        name  age  gender  salary
id
1   Shreeram   27    Male   10000
2      Shree   28  Female   12000
3        Ram   29    Male   12000
4       Riya   45    Male   13000
5     Sushma   15  Female   11000
6       John   22    Male   12000
        name  age  gender  salary
id
1   Shreeram   27    Male   10000
2      Shree   28  Female   12000
3        Ram   29    Male   12000
4       Riya   45    Male   13000
5     Sushma   15  Female   11000
6       John   22    Male   12000

In [12]:
import pymysql
def connect():
    connection = pymysql.connect(host='localhost',
                                 user='root',
                                 password='1234',
                                 database='okay',
                                 port=3306)
    df = pd.read_sql_query("select * from student", connection,index_col='roll_no')
    connection.commit() # commit keep the changes permanently in the database
    connection.close()
    topper = df.loc[df['cgpa'].idxmax()]
    print(topper)
connect()

full_name    riya parab
dept                 IT
cgpa               9.85
Name: 2, dtype: object

C:\Users\devgu\AppData\Local\Temp\ipykernel_25236\2557354053.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query("select * from student", connection,index_col='roll_no')

In [26]:
data.sort_values(by='age',ascending=True)

        name  age  gender  salary
id
5     Sushma   15  Female   11000
6       John   22    Male   12000
1   Shreeram   27    Male   10000
2      Shree   28  Female   12000
3        Ram   29    Male   12000
4       Riya   45    Male   13000

In [28]:
data.loc[data['age']>25]

        name  age  gender  salary
id
1   Shreeram   27    Male   10000
2      Shree   28  Female   12000
3        Ram   29    Male   12000
4       Riya   45    Male   13000

In [37]:
data1=pd.read_csv('employee2.csv',header=1,index_col=0)
data.loc[data['name']=='Riya']

    name  age gender  salary
id
4   Riya   45   Male   13000